In [2]:
import pymysql as py
print('Done')

Done

In [3]:
# pip install PyMySQL

In [4]:
import pymysql as py
print('Done')

Done

In [6]:
conn = py.connect(user = 'root',
           password='1234',
          host= 'localhost',
          autocommit = True)
print('connection created successfully')
print(0)

connection created successfully
0

In [10]:
#create database using python

CURSOR

In [11]:
cur= conn.cursor()
print('Done')

Done

In [14]:
query = '''create database IITM_DAY5;'''

cur.execute(query)
print('done')

done

In [16]:
query='use iitm_day5;'
cur.execute(query)
print('done')

done

In [17]:
query = '''create table student_details
(
SID int not null,
student_name varchar(50),
course varchar(50),
address varchar(50),
Scholarship float 
);'''

cur.execute(query)
print('Ban gai bhai')

Ban gai bhai

In [18]:
query = '''insert into student_details
values
(101,"Mohan ji","BCA","Delhi janakpuri",5000),
(102,"Neeraj ji","BCA","Delhi mayapuri",4000);'''

cur.execute(query)
print('done')

done

In [23]:
sid = int(input('Enter SID: '))
name = input('Enter your name: ')
course = input('Enter your course: ')
address = input('Enter your address: ')
scholarship = float(input('Enter your scholarship in RS: '))

q = f''' insert into student_details values({sid},'{name}','{course}','{address}',{scholarship});'''

cur.execute(q)
print('done')

Enter SID:  105
Enter your name:  Jatin
Enter your course:  bca
Enter your address:  pur
Enter your scholarship in RS:  5000

done

In [26]:
 n = 3
for i in range(n):
    sid = int(input('Enter SID: '))
    name = input('Enter your name: ')
    course = input('Enter your course: ')
    address = input('Enter your address: ')
    scholarship = float(input('Enter your scholarship in RS: '))

q = f''' insert into student_details values({sid},'{name}','{course}','{address}',{scholarship});'''

cur.execute(q)
print('Record inserted successfully!!')
print('done')

Enter SID:  106
Enter your name:  Ram
Enter your course:  BBA
Enter your address:  TILAK NAGAR
Enter your scholarship in RS:  1200
Enter SID:  107
Enter your name:  Shyam
Enter your course:  bba
Enter your address:  subash nagar
Enter your scholarship in RS:  4000
Enter SID:  108
Enter your name:  Pavan
Enter your course:  bba
Enter your address:  vishnu garden
Enter your scholarship in RS:  3000

Record inserted successfully!!
done

In [36]:
query = '''select * from student_details;'''
cur.execute(query)

records = cur.fetchall()

all_columns = []

for i in  cur.description:
    all_columns.append(i[0])

import pandas as pd
df=pd.DataFrame(records,columns=all_columns)
df

   SID student_name course          address  Scholarship
0  101     Mohan ji    BCA  Delhi janakpuri       5000.0
1  102    Neeraj ji    BCA   Delhi mayapuri       4000.0
2  101        jatin    Bca        Ram nagar       5000.0
3  105        Jatin    Bca           garden       5000.0
4  105        Jatin    bca              pur       5000.0
5  108        Pavan    bba    vishnu garden       3000.0

In [37]:
def show_record(db,table):
    query = f'''select * from {db}.{table};'''
    cur.execute(query)
    
    records = cur.fetchall()
    
    all_columns = []
    
    for i in  cur.description:
        all_columns.append(i[0])
    
    import pandas as pd
    df=pd.DataFrame(records,columns=all_columns)
    return df

In [38]:
show_record('iitm_day5','student_details')

   SID student_name course          address  Scholarship
0  101     Mohan ji    BCA  Delhi janakpuri       5000.0
1  102    Neeraj ji    BCA   Delhi mayapuri       4000.0
2  101        jatin    Bca        Ram nagar       5000.0
3  105        Jatin    Bca           garden       5000.0
4  105        Jatin    bca              pur       5000.0
5  108        Pavan    bba    vishnu garden       3000.0

In [39]:
show_record('iitm_db','sample_superstore')

      Row ID        Order ID  Order Date   Ship Date  ...     Sales Quantity Discount    Profit
0          1  CA-2016-152156   11/8/2016  11/11/2016  ...  261.9600        2     0.00   41.9136
1          2  CA-2016-152156   11/8/2016  11/11/2016  ...  731.9400        3     0.00  219.5820
2          3  CA-2016-138688   6/12/2016   6/16/2016  ...   14.6200        2     0.00    6.8714
3          4  US-2015-108966  10/11/2015  10/18/2015  ...  957.5775        5     0.45 -383.0310
4          5  US-2015-108966  10/11/2015  10/18/2015  ...   22.3680        2     0.20    2.5164
...      ...             ...         ...         ...  ...       ...      ...      ...       ...
9689    9990  CA-2014-110422   1/21/2014   1/23/2014  ...   25.2480        3     0.20    4.1028
9690    9991  CA-2017-121258   2/26/2017    3/3/2017  ...   91.9600        2     0.00   15.6332
9691    9992  CA-2017-121258   2/26/2017    3/3/2017  ...  258.5760        2     0.20   19.3932
9692    9993  CA-2017-121258   2/26/2017    3/3/2017  ...   29.6000        4     0.00   13.3200
9693    9994  CA-2017-119914    5/4/2017    5/9/2017  ...  243.1600        2     0.00   72.9480

[9694 rows x 21 columns]